//1 
// vector динамический, массив статический, vector сам управляет памятью, массив просто память, vector имеет методы, массив только индексация.

//2
// string владеет данными, выделяет память, string_view невладеющее представление строки
// Используй string_view для параметров функций, когда не нужно изменять, хранить строку.

//3
// system_clock для работы с реальным временем, может корректироваться
// steady_clock монотонный, никогда не переводится назад

//4
// Исключения для исключительных ситуаций, когда ошибка редкая и фатальная
// optional для ожидаемого отсутствия значения

// 5
// Препроцессинг - обработка директив.
// Компиляция - перевод кода в объектный файл.
// Линковка - связывание объектных файлов и библиотек в исполняемый файл.


№inlcude <iostrean>
№inlcude <vector>

using namespace std;

int main() {
    string 
}
